Ran Plan for dir: `environment/test` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/atlantis-data/bin/terraform1.12.2 plan -input=false -refresh -out "/atlantis-data/repos/shwetaec12/eks-atlantis-demo/8/default/environment/test/default.tfplan"' in '/atlantis-data/repos/shwetaec12/eks-atlantis-demo/8/default/environment/test': exit status 1
module.eks.data.aws_caller_identity.current: Reading...
data.aws_iam_policy_document.eks_node_group_assume: Reading...
aws_iam_openid_connect_provider.oidc: Refreshing state... [id=arn:aws:iam::895976263444:oidc-provider/oidc.eks.eu-central-1.amazonaws.com/id/3BFFE8CF83A9EF9B9503868907B06C39]
module.eks.module.kms.data.aws_partition.current[0]: Reading...
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/my-eks-cluster/cluster]
module.eks.data.aws_partition.current: Reading...
module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0f71346aacb10106d]
module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
data.aws_iam_policy_document.eks_node_group_assume: Read complete after 0s [id=2851119427]
aws_iam_role.node_group_role: Refreshing state... [id=eks-node-group-role]
module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=895976263444]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.eks.data.aws_caller_identity.current: Read complete after 0s [id=895976263444]
module.eks.data.aws_iam_session_context.current: Reading...
module.eks.aws_iam_role.this[0]: Refreshing state... [id=my-eks-cluster-cluster-20250608205255912900000001]
aws_iam_role.eks_admin: Refreshing state... [id=eks-admin]
module.eks.data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:sts::895976263444:assumed-role/atlantis-irsa-role/1749953177867906391]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-02583f947ec11ddbf]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0187482a5ab4e0656]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-07c46d6e13ca85fa7]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-04649c48c8480f7bc]
module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-0e7f428dc156bc738]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-072ac13db18cc7f7a]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-03a1d9a327675dcf1]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-06d2c5bdb823d7607]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0def7ffa6b913c78d]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-06c5664430fc0a4e9]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0822587ed33e5ad5b]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0cef3ac3aede352ef]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-01f20df3c48544aee]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0def7ffa6b913c78d1080289494]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0acf8969c4a5be3ac]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-04b37e5a813bf52ea]
module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-3004828921]
module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-1555398731]
module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-1681001314]
module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-288785689]
module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-3921118989]
module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-182202580]
module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-3228412045]
module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-1863296893]
module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-3631538831]
module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-2945052005]
module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-3408453294]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-00b19b9571a583b40]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0d1a5c2cbc192ce9f]
aws_iam_role_policy_attachment.node_group_cni_policy: Refreshing state... [id=eks-node-group-role-20250608205256683500000005]
aws_iam_role_policy_attachment.node_group_worker_node: Refreshing state... [id=eks-node-group-role-20250608205256668700000004]
aws_iam_role_policy_attachment.node_group_ecr_readonly: Refreshing state... [id=eks-node-group-role-20250608205256637300000003]
aws_iam_role_policy_attachment.eks_admin_attach: Refreshing state... [id=eks-admin-20250608205256961200000006]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=my-eks-cluster-cluster-20250608205255912900000001-20250608205256988900000008]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=my-eks-cluster-cluster-20250608205255912900000001-20250608205256970600000007]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-09478dec567b4744e]
module.eks.module.eks_managed_node_group["default"].data.aws_partition.current: Reading...
module.eks.module.eks_managed_node_group["default"].data.aws_caller_identity.current: Reading...
module.eks.module.eks_managed_node_group["default"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=2157275577]
module.eks.module.eks_managed_node_group["default"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks_managed_node_group["default"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.module.eks_managed_node_group["default"].data.aws_caller_identity.current: Read complete after 0s [id=895976263444]
module.eks.module.eks_managed_node_group["default"].aws_iam_role.this[0]: Refreshing state... [id=default-eks-node-group-20250608205256535500000002]
module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=6117f541-22d6-46a9-a5a5-fad4c72805ee]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0cef3ac3aede352ef1080289494]
module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=default-eks-node-group-20250608205256535500000002-20250608205257211700000009]
module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=default-eks-node-group-20250608205256535500000002-2025060820525722440000000a]
module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=default-eks-node-group-20250608205256535500000002-2025060820525722780000000b]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_iam_openid_connect_provider.oidc has been deleted
  - resource "aws_iam_openid_connect_provider" "oidc" {
      - arn             = "arn:aws:iam::895976263444:oidc-provider/oidc.eks.eu-central-1.amazonaws.com/id/3BFFE8CF83A9EF9B9503868907B06C39" -> null
        id              = "arn:aws:iam::895976263444:oidc-provider/oidc.eks.eu-central-1.amazonaws.com/id/3BFFE8CF83A9EF9B9503868907B06C39"
        tags            = {}
        # (4 unchanged attributes hidden)
    }

  # module.vpc.aws_internet_gateway.this[0] has been deleted
  - resource "aws_internet_gateway" "this" {
      - arn      = "arn:aws:ec2:eu-central-1:895976263444:internet-gateway/igw-04649c48c8480f7bc" -> null
      - id       = "igw-04649c48c8480f7bc" -> null
        tags     = {
            "Environment" = "production"
            "Name"        = "eks-vpc-test"
        }
        # (3 unchanged attributes hidden)
    }

  # module.vpc.aws_route.public_internet_gateway[0] has been deleted
  - resource "aws_route" "public_internet_gateway" {
      - id                          = "r-rtb-0def7ffa6b913c78d1080289494" -> null
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.module.eks_managed_node_group["default"].aws_iam_role.this[0] has been deleted
  - resource "aws_iam_role" "this" {
      - arn                   = "arn:aws:iam::895976263444:role/default-eks-node-group-20250608205256535500000002" -> null
        id                    = "default-eks-node-group-20250608205256535500000002"
      - name                  = "default-eks-node-group-20250608205256535500000002" -> null
        tags                  = {
            "Environment" = "production"
        }
      - unique_id             = "AROA5BHCYZ4KD4SVTM553" -> null
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # data.aws_iam_policy_document.atlantis_assume_role_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "atlantis_assume_role_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:default:atlantis-new",
                ]
              + variable = "oidc.eks.eu-central-1.amazonaws.com/id/C73BE2AE0D7D948ADA92A8E0DDAA1D3F:sub"
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # data.aws_iam_policy_document.eks_admin_assume will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "eks_admin_assume" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # aws_iam_openid_connect_provider.oidc will be created
  + resource "aws_iam_openid_connect_provider" "oidc" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags_all        = (known after apply)
      + thumbprint_list = [
          + "9e99a48a9960b14926bb7f3b02e22da0cbed5e11",
        ]
      + url             = "https://oidc.eks.eu-central-1.amazonaws.com/id/C73BE2AE0D7D948ADA92A8E0DDAA1D3F"
    }

  # aws_iam_role.atlantis_irsa_role will be created
  + resource "aws_iam_role" "atlantis_irsa_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "atlantis-irsa-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.eks_admin will be updated in-place
  ~ resource "aws_iam_role" "eks_admin" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::895976263444:oidc-provider/oidc.eks.eu-central-1.amazonaws.com/id/C73BE2AE0D7D948ADA92A8E0DDAA1D3F"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "eks-admin"
        name                  = "eks-admin"
        tags                  = {}
        # (11 unchanged attributes hidden)
    }

  # aws_iam_role_policy.atlantis_policy will be created
  + resource "aws_iam_role_policy" "atlantis_policy" {
      + id          = (known after apply)
      + name        = "atlantis-iam-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "*"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.node_group_extra_access will be created
  + resource "aws_iam_role_policy" "node_group_extra_access" {
      + id          = (known after apply)
      + name        = "extra-node-group-access"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "iam:GetRole",
                          + "iam:GetOpenIDConnectProvider",
                          + "ec2:DescribeVpcAttribute",
                          + "logs:DescribeLogGroups",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "eks-node-group-role"
    }

  # aws_iam_role_policy_attachment.node_group_admin_access will be created
  + resource "aws_iam_role_policy_attachment" "node_group_admin_access" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "eks-node-group-role"
    }

  # module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Environment" = "production"
          + "Name"        = "eks-vpc-test-eu-central-1a"
        }
      + tags_all             = {
          + "Environment" = "production"
          + "Name"        = "eks-vpc-test-eu-central-1a"
        }
      + vpc                  = (known after apply)
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Environment" = "production"
          + "Name"        = "eks-vpc-test"
        }
      + tags_all = {
          + "Environment" = "production"
          + "Name"        = "eks-vpc-test"
        }
      + vpc_id   = "vpc-0f71346aacb10106d"
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Environment" = "production"
          + "Name"        = "eks-vpc-test-eu-central-1a"
        }
      + tags_all                           = {
          + "Environment" = "production"
          + "Name"        = "eks-vpc-test-eu-central-1a"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "production"
          + "Name"        = "eks-vpc-test-private"
        }
      + tags_all         = {
          + "Environment" = "production"
          + "Name"        = "eks-vpc-test-private"
        }
      + vpc_id           = "vpc-0f71346aacb10106d"
    }

  # module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "production"
          + "Name"        = "eks-vpc-test-public"
        }
      + tags_all         = {
          + "Environment" = "production"
          + "Name"        = "eks-vpc-test-public"
        }
      + vpc_id           = "vpc-0f71346aacb10106d"
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-03a1d9a327675dcf1"
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-06c5664430fc0a4e9"
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "production"
          + "Name"        = "eks-vpc-test-public-eu-central-1a"
        }
      + tags_all                                       = {
          + "Environment" = "production"
          + "Name"        = "eks-vpc-test-public-eu-central-1a"
        }
      + vpc_id                                         = "vpc-0f71346aacb10106d"
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "production"
          + "Name"        = "eks-vpc-test-public-eu-central-1b"
        }
      + tags_all                                       = {
          + "Environment" = "production"
          + "Name"        = "eks-vpc-test-public-eu-central-1b"
        }
      + vpc_id                                         = "vpc-0f71346aacb10106d"
    }

  # module.eks.module.eks_managed_node_group["default"].aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EKSNodeAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "EKS managed node group IAM role"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "default-eks-node-group-"
      + path                  = "/"
      + tags                  = {
          + "Environment" = "production"
        }
      + tags_all              = {
          + "Environment" = "production"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = (known after apply)
    }

Plan: 22 to add, 1 to change, 0 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with module.eks.aws_iam_role.this[0],
│   on .terraform/modules/eks/main.tf line 293, in resource "aws_iam_role" "this":
│  293: resource "aws_iam_role" "this" {
│ 
│ inline_policy is deprecated. Use the aws_iam_role_policy resource instead.
│ If Terraform should exclusively manage all inline policy associations (the
│ current behavior of this argument), use the aws_iam_role_policies_exclusive
│ resource as well.
╵
╷
│ Error: reading KMS Key (6117f541-22d6-46a9-a5a5-fad4c72805ee): reading KMS Key (6117f541-22d6-46a9-a5a5-fad4c72805ee): operation error KMS: DescribeKey, https response error StatusCode: 400, RequestID: 3f5edb1f-ad46-4a1d-82e6-b6b69900674d, api error AccessDeniedException: User: arn:aws:sts::895976263444:assumed-role/atlantis-irsa-role/1749953177867906391 is not authorized to perform: kms:DescribeKey on resource: arn:aws:kms:eu-central-1:895976263444:key/6117f541-22d6-46a9-a5a5-fad4c72805ee because no resource-based policy allows the kms:DescribeKey action
│ 
│   with module.eks.module.kms.aws_kms_key.this[0],
│   on .terraform/modules/eks.kms/main.tf line 18, in resource "aws_kms_key" "this":
│   18: resource "aws_kms_key" "this" {
│ 
╵

```
</details>